       IDENTIFICATION DIVISION.
       PROGRAM-ID. SEQUENCE1.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT 1SEQUENCE-FILE
               ASSIGN TO ".SEATWORKS/SEQUENCES/SEQDATA/1SEQUENCE.DAT"
               ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD  1SEQUENCE-FILE
           LABEL RECORD IS STANDARD
           DATA RECORD IS 1SEQUENCE-REC.

       01  1SEQUENCE-REC.
           05  MYNAMEE   PIC X(50).

       PROCEDURE DIVISION.
           OPEN EXTEND 1SEQUENCE-FILE
           MOVE "KIM PHILLIP G. ANDADOR" TO MYNAMEE
               DISPLAY MYNAMEE
           WRITE 1SEQUENCE-REC
               DISPLAY MYNAMEE
           WRITE 1SEQUENCE-REC
               DISPLAY MYNAMEE
           WRITE 1SEQUENCE-REC
               DISPLAY MYNAMEE
           WRITE 1SEQUENCE-REC
               DISPLAY MYNAMEE
           WRITE 1SEQUENCE-REC
           CLOSE 1SEQUENCE-FILE
       STOP RUN.
