       IDENTIFICATION DIVISION.
       PROGRAM-ID. 1LOOP.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 COUNTER PIC 9(5) VALUE 0.
       PROCEDURE DIVISION.
           PERFORM UNTIL COUNTER > 4
               DISPLAY "KIM PHILLIP G. ANDADOR"
               ADD 1 TO COUNTER
           END-PERFORM.
       STOP RUN.
