       IDENTIFICATION DIVISION.
       PROGRAM-ID. 1LOOP.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT 1ITER-FILE
           ASSIGN TO 
           "ITERDATA/1ITER.DAT"
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD  1ITER-FILE
           LABEL RECORD IS STANDARD
           DATA RECORD IS 1ITER-REC.
       01  1ITER-REC PIC X(15).
       WORKING-STORAGE SECTION.
       01 COUNTER PIC 9(5) VALUE 0.
       PROCEDURE DIVISION.
           OPEN EXTEND 1ITER-FILE.
           
           PERFORM UNTIL COUNTER > 4
               DISPLAY "KIM PHILLIP G. ANDADOR"
               MOVE "KIM PHILLIP G. ANDADOR" TO 1ITER-REC
               WRITE 1ITER-REC
               ADD 1 TO COUNTER
           END-PERFORM.
       
           CLOSE 1ITER-FILE.
       EXIT PROGRAM.
