       IDENTIFICATION DIVISION.
       PROGRAM-ID. 6SEQUENCE.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT 6SEQUENCE-FILE
               ASSIGN TO 
              "SEQUENCES/SEQDATA/6SEQUENCE.DAT"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD  6SEQUENCE-FILE
           LABEL RECORD IS STANDARD
           DATA RECORD IS 6SEQUENCE-REC.

       01  6SEQUENCE-REC PIC ZZZZZZZZZZZZ.99.

       WORKING-STORAGE SECTION.
           01  NUM         PIC 9(9).
           01  SQUARE      PIC 9(11)V99.
           01  CUBE        PIC 9(13)V99.
           01  SQUARE-OUT  PIC ZZZZZZZZZZZ.99.
           01  CUBE-OUT    PIC ZZZZZZZZZZZZ.99.

       PROCEDURE DIVISION.
           OPEN EXTEND 6SEQUENCE-FILE

           DISPLAY "Input number: " WITH NO ADVANCING
           ACCEPT NUM

           MOVE NUM TO 6SEQUENCE-REC
           WRITE 6SEQUENCE-REC

           COMPUTE SQUARE = NUM * NUM
           COMPUTE CUBE   = NUM * NUM * NUM

           MOVE SQUARE TO SQUARE-OUT
           MOVE CUBE   TO CUBE-OUT

           DISPLAY SPACE
           DISPLAY "Square: " FUNCTION TRIM(SQUARE-OUT)
           DISPLAY "Cube: " FUNCTION TRIM(CUBE-OUT)

           MOVE SQUARE-OUT TO 6SEQUENCE-REC
           WRITE 6SEQUENCE-REC
           MOVE CUBE-OUT TO 6SEQUENCE-REC
           WRITE 6SEQUENCE-REC

           CLOSE 6SEQUENCE-FILE
           EXIT PROGRAM.
