       IDENTIFICATION DIVISION.
       PROGRAM-ID. 3SEQUENCE.
       DATA DIVISION.
           WORKING-STORAGE SECTION.
           1 CELSIUS PIC 9(9)V99.
           1 FAREN PIC 9(9)V99.
           1 FAREN_OUT PIC ZZZZZZZZ9.99.
       PROCEDURE DIVISION.
               DISPLAY "INPUT CELSIUS: " WITH NO ADVANCING.
               ACCEPT CELSIUS.
               COMPUTE FAREN = (9/5) * CELSIUS + 32
               MOVE FAREN TO FAREN_OUT.
               DISPLAY "CONVERTED TO FAHRENHEIT: " FAREN_OUT.
       EXIT PROGRAM.
