       IDENTIFICATION DIVISION.
       PROGRAM-ID. 1SEQUENCE.
       PROCEDURE DIVISION.
            DISPLAY "KIM PHILLIP G. ANDADOR".
            DISPLAY "KIM PHILLIP G. ANDADOR".
            DISPLAY "KIM PHILLIP G. ANDADOR".
            DISPLAY "KIM PHILLIP G. ANDADOR".
            DISPLAY "KIM PHILLIP G. ANDADOR".
       STOP RUN.
