       IDENTIFICATION DIVISION.
       PROGRAM-ID. 2LOOP.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 COUNTER PIC 9(5) VALUE 0.
       01 COUNTER_OUT PIC ZZ VALUE 0.
       PROCEDURE DIVISION.
           PERFORM UNTIL COUNTER > 4
               ADD 1 TO COUNTER
               MOVE COUNTER TO COUNTER_OUT
              
               DISPLAY COUNTER_OUT
           END-PERFORM.
       EXIT PROGRAM.
