       IDENTIFICATION DIVISION.
       PROGRAM-ID. 2LOOP.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL. 
           SELECT 2ITER-FILE 
           ASSIGN TO 
           "ITERDATA/2ITER.DAT"
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD  2ITER-FILE
           LABEL RECORD IS STANDARD
           DATA RECORD IS 2ITER-REC.
       01  2ITER-REC PIC X(30).
       WORKING-STORAGE SECTION.
       01 COUNTER PIC 9(5) VALUE 0.
       01 COUNTER_OUT PIC ZZ VALUE 0.

       PROCEDURE DIVISION.
           CALL "CLEAR-SCREEN"
           OPEN EXTEND 2ITER-FILE
       
           PERFORM UNTIL COUNTER > 4
               ADD 1 TO COUNTER
               MOVE COUNTER TO COUNTER_OUT
              
               DISPLAY COUNTER_OUT
               MOVE COUNTER_OUT TO 2ITER-REC
               WRITE 2ITER-REC
           END-PERFORM.

           CLOSE 2ITER-FILE.
       EXIT PROGRAM.
