       IDENTIFICATION DIVISION.
       PROGRAM-ID. 3SEQUENCE.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT 3SEQUENCE-FILE
               ASSIGN TO 
              "SEQDATA/3SEQUENCE.DAT"
               ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD  3SEQUENCE-FILE
           LABEL RECORD IS STANDARD
           DATA RECORD IS 3SEQUENCE-REC.
       01  3SEQUENCE-REC PIC ZZZZZZZZ9.99.
 
       WORKING-STORAGE SECTION.
       01  CELSIUS PIC 9(9)V99.
       01  FAREN PIC 9(9)V99.
       01  FAREN_OUT PIC ZZZZZZZZ9.99.

       PROCEDURE DIVISION.
               CALL "CLEAR-SCREEN"
               OPEN EXTEND 3SEQUENCE-FILE
               
               DISPLAY "INPUT CELSIUS: " WITH NO ADVANCING.
               ACCEPT CELSIUS.
               COMPUTE FAREN = (9/5) * CELSIUS + 32
               
               MOVE FAREN TO FAREN_OUT.
               DISPLAY "CONVERTED TO FAHRENHEIT: " FAREN_OUT.
               
               MOVE CELSIUS TO 3SEQUENCE-REC.
               WRITE 3SEQUENCE-REC.
               MOVE FAREN_OUT TO 3SEQUENCE-REC.
               WRITE 3SEQUENCE-REC.
               
               CLOSE 3SEQUENCE-FILE.
       EXIT PROGRAM.
